fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <comment>Бозырь С.Р. 09.07.2025</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <comment>Бозырь С.Р. 09.07.2025</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <comment>Бозырь С.Р. 09.07.2025</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <comment>Бозырь С.Р. 09.07.2025</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/CommonModules/ВКМ_РаботаСФормамиСервер/Module.bsl
Процедура ДополнитьФорму(Форма) Экспорт
	
    ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКнопкуЗаполнить(Форма);
	ИначеЕсли ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ВКМ_ФормаЭлемента" Тогда
		ДобавитьЭлементыАбонентскогоОбслуживания(Форма);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДобавитьКнопкуЗаполнить(Форма)

	Если Форма.Элементы.Найти("Заполнить") <> Неопределено Тогда
	    Возврат;
	КонецЕсли;
	
	Команда = Форма.Команды.Добавить("ВКМ_ЗаполнитьДляАбонПлаты"); 
	Команда.Действие = "ВКМ_ЗаполнитьДляАбонПлаты";
	Команда.Заголовок = "Заполнить";
	
	Кнопка = Форма.Элементы.Добавить("Заполнить", Тип("КнопкаФормы"), Форма.Элементы.Услуги.КоманднаяПанель);
    Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Кнопка.Отображение = ОтображениеКнопки.Текст;
    Кнопка.ИмяКоманды = "ВКМ_ЗаполнитьДляАбонПлаты";
	
КонецПроцедуры 

Процедура ДобавитьЭлементыАбонентскогоОбслуживания(Форма)

	Если Форма.Элементы.Найти("ГруппаАбонентскоеОбслуживание") <> Неопределено Тогда
	    Возврат;
	КонецЕсли;
	
	ГруппаАбонентскоеОбслуживание = Форма.Элементы.Добавить("ГруппаАбонентскоеОбслуживание", Тип("ГруппаФормы"));
	ГруппаАбонентскоеОбслуживание.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАбонентскоеОбслуживание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ГруппаАбонентскоеОбслуживание.Видимость = Ложь;
	
	ГруппаПериодДействияДоговора = Форма.Элементы.Добавить("ГруппаПериодДействияДоговора", Тип("ГруппаФормы"), Форма.Элементы.ГруппаАбонентскоеОбслуживание);
	ГруппаПериодДействияДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериодДействияДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ПолеВвода = Форма.Элементы.Добавить("ДатаНачалаДействияДоговора", Тип("ПолеФормы"), Форма.Элементы.ГруппаПериодДействияДоговора);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Заголовок = "Начало действия договора";
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	
	ПолеВвода = Форма.Элементы.Добавить("ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), Форма.Элементы.ГруппаПериодДействияДоговора);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Заголовок = "Окончание действия договора";
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";

	ГруппаСтоимостьОбслуживания = Форма.Элементы.Добавить("ГруппаСтоимостьОбслуживания", Тип("ГруппаФормы"), Форма.Элементы.ГруппаАбонентскоеОбслуживание);
	ГруппаСтоимостьОбслуживания.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСтоимостьОбслуживания.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ПолеВвода = Форма.Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"), Форма.Элементы.ГруппаСтоимостьОбслуживания);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Заголовок = "Сумма абон. платы";
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	ПолеВвода = Форма.Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), Форма.Элементы.ГруппаСтоимостьОбслуживания);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Заголовок = "Стоимость часа работы";
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
КонецПроцедуры
